book_assessment.tex
% Created 2025-08-05 Tue 02:55
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{CEH Self Assessment Report}
\hypersetup{
 pdfauthor={},
 pdftitle={CEH Self Assessment Report},
 pdfkeywords={},
 pdfsubject={Assessment of current CEH Knowlege based on book assessment on online official self-assessment},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Book Assessment Test 1}
\label{sec:org2f48c3d}
\subsection{Assessment blind answers.}
\label{sec:org553115e}

\ref{sec:org71ca0b7}

\begin{enumerate}
\item B, the IP ID is an arbitrary integer that is incremented for each packet. This is how the source and destination keep track of the order of packets to recombine them at the end.
\item C, SQL Injection tries to trick the server into executing SQL code by appending it somewhere. The "OR 1=1" is a common string used for SQL injection because it can be appended to almost anything and return true in SQL.
\item Could be A, B, C, or D.
\begin{itemize}
\item A would be unlikely due to the rigorous verification process of the stores. But sometimes you can find a way.
\item B could certainly be an attack path, if you can get a victim to insert an SD card or USB stick, convince them to run an APK file or something else.
\item C could also be used, there are third party app stores such as F-droid, you could create an insecure app store as long as you can convince the user to trust and install it.
\item D jailbreaking is a common practice, you could disguise the malware as a jailbreaking tool or state that it requires the user's device to be rooted in order to use it. A rooted device can do so much more than an OEM device.
\end{itemize}
\item B, the ARP protocol is used to maintain a table of IP addresses (unsure)
\item C, a buffer overflow is when a program writes into memory beyond the allocated buffer which can impact the values of other variables and thus other functions of the app insecurely.
\item No idea, I understand the fundamental concept here but I do not know how they map to ip ranges.
\item D, I don't actually know, but based on the etymology here I am making a guess. Needs to be studied
\item A, this makes most intuitive sense to me. C doesn't make sense, if probability is higher it should increase risk not decrease.
\item B, This is just an intuitive guess based on word meaning. I'm not sure what a four-way handshake is. Worth studying.
\item D, Stateful firewalls, iirc will actively inspect packets before they reach the endpoints to find malware signatures. Worth reviewing even if right.
\item D, The other answers can be true sometimes but this is the primary purpose afaik. When configuring new applications we make sure they are aligned with our policies.
\item B, this looks like URL encoding because it uses url codes with percent characters.
\item B, dig is a DNS tracing tool, we can specify a Name Server record (ns) before or after the domain. Its worth learning the fundamental DNS record types.
\item A, I believe a DNS Query is sufficient to get this information, may need specific record types. However it is worth learning what a zone transfer is.
\item C, this is just an intuitive guess, this is a topic worth looking into.
\item D, The only one im uncertain of is if this is considered light on network traffic. You do need to ping a lot of addresses sometimes in a short period of time. But otherwise yeah, pings are very commonly allowed and they don't need a port scan. The downside is that plenty of places like to ignore pings (ICMP)
\item No idea, time to read up.
\item B, it's common for secure systems to either not have python installed unless absolutely necessary, or they will only allow a specific user to run the python interpreter. A could also be true in some cases.
\item B, I don't remember the exact syntax, but I believe you can specify source and destination, host would include both.
\item No clue, need to read on this.
\item D, although imitation sounds right, I don't remember it being a core principle of social engineering, authority refers to the authority that a help desk demands which induces trust in the victim.
\item No clue, need to read up
\item No clue, need to read up
\item C, just an intuitive guess, needs review
\item D, i kind of know this, and all the other ones are bullshit lmao
\item C, this is an intuitive guess, privilege escalation would be something you need to exploit the local system for. Which would lead to the others in this list. However, its worth reviewing what they really mean by "local" vulnerability.
\item D, authority is using an "authority" to determine if someone is who they say they are. However this is a bit fuzzy for me. Worth reviewing.
\item D, tailgating is closely following an authorized person to get through a door, man-traps are those rotating contraptions that make sure only one person can enter at a time.
\item A, I have no idea what each of these are other than they are bluetooth attacks. I assume "snarfing" is listening while "jacking" is sending something. So guessing A, but need to review these.
\item No idea, gotta look up Biba
\end{enumerate}
\subsection{Scorin}
\label{sec:orgc82a734}

\subsubsection{Correctness (did I get the answer right)}
\label{sec:orgdfc0e48}

\begin{center}
\begin{tabular}{rr}
\# & Correctness\\
\hline
1 & 1\\
2 & 1\\
3 & 1\\
4 & 1\\
5 & 1\\
6 & 0\\
7 & 0\\
8 & 1\\
9 & 1\\
10 & 0\\
11 & 0\\
12 & 1\\
13 & 1\\
14 & 0\\
15 & 0\\
16 & 1\\
17 & 0\\
18 & 1\\
19 & 1\\
20 & 0\\
21 & 1\\
22 & 0\\
23 & 0\\
24 & 1\\
25 & 1\\
26 & 1\\
27 & 0\\
28 & 1\\
29 & 0\\
30 & 0\\
\end{tabular}
\end{center}
\subsubsection{TODO: Do something}
\label{sec:org71ca0b7}
\begin{verbatim}
print("wow")
return "wow"
\end{verbatim}

\begin{verbatim}
def foo(x):
  if x>0:
    return x+1

  else:
    return x-1

return foo(5)
\end{verbatim}

\begin{verbatim}
import random
if random.randint(0,10) % 2 == 0:
    "even"
else:
    "odd"
\end{verbatim}

\href{https://www.youtube.com/watch?v=SzA2YODtgK4}{Link to a cool video on org-mode}
\end{document}
